package com.yedam.java.ch0402;

public class forWhile {
	public static void main(String[] args) {
		//문제1) 책 161페이지 5번
		//		for문을 이용해서 다음과 같이 *를 출력하는 코드
		
		// 문제2) for문을 이용해서 1부터 100까지의 정수 중에서
		// 		 2의 배수가 아닌 숫자의 갯수를 구하세요.
		
		//문제3) 책 161페이지 3번
		//		while문과 Math,random() 함수를 이용
		//      2개의 주사위를 던졌을 때 숫자를 (숫자1, 숫자2)로 출력
		//		숫자의 합이 5일 경우에 종료, 아닌 경우에 계속 던짐
		//		최종으로 주사위를 몇번 던졌는지 횟수를 출력
		//		숫자의 합이 5가 되는 조합은 (1,4), (4,1), (2,3),(3,2
		
		
		//문제3-1) do ~ while문 Math.random()함수를 이용
		//		1~10 의 정수 중 7이라는 수가 나올때까지 숫자를 출력
		
		
		//문제4) 
		
	}

}
